{
   "posts":[
      {
         "userId":1,
         "id":1,
         "slug":"ssr-explained",
         "imgSrc":"https://assets-global.website-files.com/5debb9b4f88fbc3f702d579e/60a8313c8d910f78f360ee18_server-side-rendering.png",
         "title":"How SSR works!",
         "link":"https://medium.com/@swazza85/ssr-with-react-9cb197cfe380",
         "body":"SSR stands for Server Side Rendering. It is a technique used to improve the perceived page load times. In a non-SSR scenario, the react app is served up as a bunch of static files. The following steps (more or less) take place before the user can see the first render of the app"
      },
      {
         "userId":1,
         "id":2,
         "slug":"vscode-tricks",
         "link":"https://code.visualstudio.com/docs/getstarted/tips-and-tricks",
         "imgSrc":"https://i.ytimg.com/vi/ifTF3ags0XI/maxresdefault.jpg",
         "title":"VSCode tips and tricks!",
         "body":"Tips and Tricks lets you jump right in and learn how to be productive with Visual Studio Code. You'll become familiar with its powerful editing, code intelligence, and source code control features and learn useful keyboard shortcuts. This topic goes pretty fast and provides a broad overview, so be sure to look at the other in-depth topics in Getting Started and the User Guide to learn more."
      },
      {
         "userId":2,
         "id":3,
         "slug":"aboard-of-fireship",
         "imgSrc":"https://play-lh.googleusercontent.com/nTZoOQ1r2ElzC5WKu-R7xeDv7FnJrCCBhRdoHQY3Px2Z9BbM_n_PVhomxUXP37sXjA",
         "link":"https://fireship.io/",
         "title":"Fireship.io: Great WebDev learning platform",
         "body":"Fireship.io is a gateway drug for developers who want to build awesome web & mobile apps.. Check out the link to find out more!"
      },
      {
         "userId":2,
         "id":4,
         "slug":"kevin-css-guru",
         "link":"https://www.kevinpowell.co/",
         "imgSrc":"https://scrimba.com/podcast/content/images/2022/05/Kevin-rectangle-1.png",
         "title":"CSS is awsome (if you know it)",
         "body":"Hi there! My name is Kevin and I'm a CSS Evangelist. I absolutely love CSS, and I want to help new front-end devs enjoy learning it, and help seasoned vets see how great it really is.Most of my content is over on YouTube, but I also stream on Twitch, and write articles every now and then as well, not to mention my courses."
      }
   ],
   "recipes": [
  {
    "id": 1,
    "name": "Spaghetti Carbonara",
    "description": "A classic Italian pasta dish with eggs, cheese, pancetta, and pepper.",
    "steps": [
      "Boil spaghetti in salted water until al dente.",
      "In a separate pan, cook pancetta until crispy.",
      "In a bowl, mix eggs, grated Pecorino Romano cheese, and black pepper.",
      "Combine cooked spaghetti and pancetta, then mix in the egg mixture.",
      "Serve immediately with extra cheese and pepper."
    ]
  },
  {
    "id": 2,
    "name": "Chicken Alfredo",
    "description": "Creamy pasta dish with grilled chicken, Alfredo sauce, and fettuccine.",
    "steps": [
      "Cook fettuccine pasta until tender.",
      "Season chicken breast and grill until cooked through.",
      "In a saucepan, heat Alfredo sauce until warm.",
      "Slice grilled chicken and add it to the sauce.",
      "Serve the creamy chicken Alfredo over cooked pasta."
    ]
  },
  {
    "id": 3,
    "name": "Beef Tacos",
    "description": "Tasty tacos filled with seasoned ground beef, lettuce, cheese, and salsa.",
    "steps": [
      "Brown ground beef in a skillet, seasoning with taco seasoning.",
      "Warm tortillas in the oven or on a griddle.",
      "Assemble tacos with beef, lettuce, cheese, and salsa.",
      "Serve hot and enjoy your beef tacos!"
    ]
  },
  {
    "id": 4,
    "name": "Caesar Salad",
    "description": "A classic salad with romaine lettuce, croutons, Parmesan cheese, and Caesar dressing.",
    "steps": [
      "Wash and chop romaine lettuce.",
      "Toss with croutons, grated Parmesan cheese, and Caesar dressing.",
      "Optional: Add grilled chicken for a Caesar Chicken Salad."
    ]
  },
  {
    "id": 5,
    "name": "Vegetable Stir-Fry",
    "description": "A quick and healthy stir-fry with mixed vegetables and your choice of protein.",
    "steps": [
      "Heat oil in a wok or large skillet.",
      "Stir-fry vegetables and protein until cooked.",
      "Add stir-fry sauce and cook briefly.",
      "Serve over cooked rice or noodles."
    ]
  },
  {
    "id": 6,
    "name": "Chocolate Chip Cookies",
    "description": "Homemade chocolate chip cookies with a soft and chewy center.",
    "steps": [
      "Preheat the oven to 350°F (175°C).",
      "Cream together butter, sugar, and brown sugar until smooth.",
      "Beat in eggs one at a time, then stir in vanilla.",
      "Combine flour, baking soda, and salt; gradually add to the butter mixture.",
      "Stir in chocolate chips.",
      "Drop dough by rounded tablespoons onto ungreased cookie sheets.",
      "Bake for 10 to 12 minutes until the edges are golden."
    ]
  },
  {
    "id": 7,
    "name": "Margarita Pizza",
    "description": "A simple and delicious pizza topped with tomato sauce, mozzarella cheese, and fresh basil.",
    "steps": [
      "Preheat your oven to its highest setting.",
      "Roll out pizza dough into a circle or rectangle.",
      "Spread tomato sauce over the dough, leaving a border for the crust.",
      "Sprinkle mozzarella cheese over the sauce.",
      "Bake in the hot oven until the crust is golden and the cheese is bubbly.",
      "Top with fresh basil leaves and a drizzle of olive oil."
    ]
  },
  {
    "id": 8,
    "name": "Chicken Noodle Soup",
    "description": "Comforting soup with chicken, vegetables, and noodles.",
    "steps": [
      "In a large pot, sauté onions, carrots, and celery until tender.",
      "Add chicken, broth, and seasonings. Simmer until chicken is cooked.",
      "Remove chicken, shred it, and return it to the pot.",
      "Add cooked noodles and simmer until heated through.",
      "Serve hot for a comforting bowl of chicken noodle soup."
    ]
  },
  {
    "id": 9,
    "name": "Greek Salad",
    "description": "A refreshing salad with cucumbers, tomatoes, olives, feta cheese, and Greek dressing.",
    "steps": [
      "Chop cucumbers, tomatoes, and red onions.",
      "Combine with Kalamata olives and crumbled feta cheese.",
      "Toss with Greek dressing and serve."
    ]
  },
  {
    "id": 10,
    "name": "Sushi Rolls",
    "description": "Homemade sushi rolls with rice, seaweed, fish, and vegetables.",
    "steps": [
      "Prepare sushi rice and cool it.",
      "Lay out a sheet of seaweed on a bamboo sushi mat.",
      "Spread a layer of rice on the seaweed, leaving a border.",
      "Add fish, vegetables, and other desired fillings.",
      "Roll up the sushi using the bamboo mat.",
      "Slice into bite-sized pieces and serve with soy sauce and wasabi."
    ]
  },
  {
    "id": 11,
    "name": "Pancakes",
    "description": "Fluffy pancakes served with maple syrup and butter.",
    "steps": [
      "In a mixing bowl, whisk together flour, sugar, baking powder, and salt.",
      "In another bowl, whisk together eggs, milk, and melted butter.",
      "Combine wet and dry ingredients until just mixed.",
      "Heat a griddle or skillet and pour batter to make pancakes.",
      "Cook until bubbles form, then flip and cook until golden brown.",
      "Serve with maple syrup and butter."
    ]
  },
  {
    "id": 12,
    "name": "Caprese Salad",
    "description": "A simple salad with tomatoes, mozzarella cheese, fresh basil, and balsamic glaze.",
    "steps": [
      "Slice tomatoes and mozzarella cheese.",
      "Arrange them on a plate with fresh basil leaves.",
      "Drizzle with balsamic glaze.",
      "Season with salt and pepper.",
      "A delightful Caprese salad is ready to serve."
    ]
  },
  {
    "id": 13,
    "name": "Beef Stroganoff",
    "description": "A hearty dish with tender strips of beef in a creamy mushroom sauce, served over egg noodles.",
    "steps": [
      "Sauté onions and mushrooms until tender.",
      "Add strips of beef and cook until browned.",
      "Stir in flour, then add beef broth and sour cream.",
      "Simmer until the sauce thickens and beef is tender.",
      "Serve over cooked egg noodles."
    ]
  },
  {
    "id": 14,
    "name": "Cesar Salad",
    "description": "A classic salad with romaine lettuce, croutons, Parmesan cheese, and Caesar dressing.",
    "steps": [
      "Wash and chop romaine lettuce.",
      "Toss with croutons, grated Parmesan cheese, and Caesar dressing.",
      "Optional: Add grilled chicken for a Caesar Chicken Salad."
    ]
  },
  {
    "id": 15,
    "name": "Homemade Lasagna",
    "description": "Layers of pasta, ricotta cheese, marinara sauce, ground beef, and mozzarella cheese.",
    "steps": [
      "Cook lasagna noodles until al dente.",
      "Layer noodles with ricotta cheese, marinara sauce, ground beef, and mozzarella cheese.",
      "Repeat the layers.",
      "Bake until bubbly and cheese is melted.",
      "Let it rest before slicing and serving."
    ]
  }
]

}
